---
kind: method
id: M:Autodesk.Revit.DB.Structure.ReleaseConditions.#ctor(System.Boolean)
source: html/e570d1d2-c65f-75a3-1215-808fab5db790.htm
---
# Autodesk.Revit.DB.Structure.ReleaseConditions.#ctor Method

Creates a new instance of ReleaseConditions.

## Syntax (C#)
```csharp
public ReleaseConditions(
	bool start
)
```

## Parameters
- **start** (`System.Boolean`) - The position on analytical element. True for start, false for end.